Revit 2026 API

# FabricSheetBentFabricLongitudinalCutLength Property

---

Specifies the cut length of the fabric sheet perpendicular to the bend edge.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double BentFabricLongitudinalCutLength { get; set; }
```
```vb
Public Property BentFabricLongitudinalCutLength As Double
	Get
	Set
```
```cpp
public:
property double BentFabricLongitudinalCutLength {
	double get ();
	void set (double value);
}
```
```fsharp
member BentFabricLongitudinalCutLength : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for bentFabricLongitudinalCutLength must be between 0 and 30000 feet. |
| InvalidObjectException | When setting this property: The data-setting method is not applicable to fabric sheets that are flat. |

Zero indicates that the fabric sheet is not shortened. This parameter applies only to bent fabric sheets.

#### Reference

FabricSheet Class

Autodesk.Revit.DB.Structure Namespace